# NSS Tutorial

Field	| Type
--------|-------
ukprn	| varchar(8)
institution	| varchar(100)
subject	| varchar(60)
level	| varchar(50)
question	| varchar(10)
A_STRONGLY_DISAGREE	| int(11)
A_DISAGREE	| int(11)
A_NEUTRAL	| int(11)
A_AGREE	| int(11)
A_STRONGLY_AGREE	| int(11)
A_NA	| int(11)
CI_MIN	| int(11)
score	| int(11)
CI_MAX	| int(11)
response	| int(11)
sample	| int(11)
aggregate	| char(1)

National Student Survey 2012

The National Student Survey <http://www.thestudentsurvey.com/> is presented to thousands of graduating students in UK Higher Education. The survey asks 22 questions, students can respond with STRONGLY DISAGREE, DISAGREE, NEUTRAL, AGREE or STRONGLY AGREE. The values in these columns represent PERCENTAGES of the total students who responded with that answer.

The table `nss` has one row per institution, subject and question.

In [1]:
# Prerequesites
from pyhive import hive
%load_ext sql
%sql hive://cloudera@quickstart.cloudera:10000/sqlzoo
%config SqlMagic.displaylimit = 20

 ·········

## 1. Check out one row

The example shows the number who responded for:

- question 1
- at 'Edinburgh Napier University'
- studying '(8) Computer Science'

**Show the the percentage who STRONGLY AGREE**

In [3]:
%%sql
SELECT "A_STRONGLY_AGREE"
  FROM nss
    WHERE question='Q01'
    AND institution='Edinburgh Napier University'
    AND subject='(8) Computer Science';

 * postgresql://postgres:***@localhost/sqlzoo
1 rows affected.

[(23,)]

## 2. Calculate how many agree or strongly agree

**Show the institution and subject where the score is at least 100 for question 15.**

In [4]:
%%sql
SELECT institution, subject
  FROM nss
    WHERE question='Q15'
    AND score>=100;

 * postgresql://postgres:***@localhost/sqlzoo
10 rows affected.

[('Kingston College', '(I) Education'),
 ('Royal Holloway, University of London', '(L) Geographical Studies'),
 ('Solihull College', '(I) Education'),
 ('Stafford College', '(D) Business and Administrative studies'),
 ('University of Southampton', '(E) Mass Communications and Documentation'),
 ('University of Wolverhampton', '(7) Mathematical Sciences'),
 ('University of Leicester', '(2) Subjects allied to Medicine'),
 ('University of Newcastle upon Tyne', '(E) Mass Communications and Documentation'),
 ('Bishop Grosseteste University College, Lincoln', '(F) Languages'),
 ('Universities of East Anglia and Essex; Joint Provision at University Campus Suffolk', '(G) Historical and Philosophical studies')]

## 3. Unhappy Computer Students

**Show the institution and score where the score for '(8) Computer Science' is less than 50 for question 'Q15'**

In [5]:
%%sql
SELECT institution, score
  FROM nss
    WHERE question='Q15'
    AND subject='(8) Computer Science'
    AND score<50;

 * postgresql://postgres:***@localhost/sqlzoo
6 rows affected.

[('Blackburn College', 45),
 ('North Lindsey College', 30),
 ('Plymouth College of Art', 47),
 ('Somerset College of Arts and Technology', 48),
 ('University of Wales, Newport', 30),
 ('Universities of East Anglia and Essex; Joint Provision at University Campus Suffolk', 45)]

## 4. More Computing or Creative Students?

**Show the subject and total number of students who responded to question 22 for each of the subjects '(8) Computer Science' and '(H) Creative Arts and Design'.**

> _HINT_    
> You will need to use SUM over the response column and GROUP BY subject

In [6]:
%%sql
SELECT subject, SUM(response) tot_response
  FROM nss
    WHERE question='Q22'
    AND subject IN ('(8) Computer Science', '(H) Creative Arts and Design')
    GROUP BY subject;

 * postgresql://postgres:***@localhost/sqlzoo
2 rows affected.

[('(H) Creative Arts and Design', 33336), ('(8) Computer Science', 10252)]

## 5. Strongly Agree Numbers

**Show the subject and total number of students who A_STRONGLY_AGREE to question 22 for each of the subjects '(8) Computer Science' and '(H) Creative Arts and Design'.**

> _HINT_    
> The A_STRONGLY_AGREE column is a percentage. To work out the total number of students who strongly agree you must multiply this percentage by the number who responded (response) and divide by 100 - take the SUM of that.

In [8]:
%%sql
SELECT subject, sum(response * "A_STRONGLY_AGREE"/100) n_strongly_agree
  FROM nss
    WHERE question='Q22'
    AND subject IN ('(8) Computer Science', '(H) Creative Arts and Design')
    GROUP BY subject;

 * postgresql://postgres:***@localhost/sqlzoo
2 rows affected.

[('(H) Creative Arts and Design', 11992), ('(8) Computer Science', 3355)]

## 6. Strongly Agree, Percentage

**Show the percentage of students who A_STRONGLY_AGREE to question 22 for the subject '(8) Computer Science' show the same figure for the subject '(H) Creative Arts and Design'.**

Use the **ROUND** function to show the percentage without decimal places.

In [9]:
%%sql
SELECT subject, ROUND(SUM("A_STRONGLY_AGREE" * response) / SUM(response)) pct_strongly_agree
  FROM nss
    WHERE question='Q22'
    AND subject IN ('(8) Computer Science', '(H) Creative Arts and Design')
    GROUP BY subject;

 * postgresql://postgres:***@localhost/sqlzoo
2 rows affected.

[('(H) Creative Arts and Design', 36.0), ('(8) Computer Science', 33.0)]

## 7. Scores for Institutions in Manchester

**Show the average scores for question 'Q22' for each institution that include 'Manchester' in the name.**

The column **score** is a percentage - you must use the method outlined above to multiply the percentage by the **response** and divide by the total response. Give your answer rounded to the nearest whole number.

In [10]:
%%sql
SELECT institution, ROUND(SUM(response * score)/SUM(response)) score
  FROM nss
    WHERE question='Q22'
    AND (institution LIKE '%Manchester%')
    GROUP BY institution
    ORDER BY institution;

 * postgresql://postgres:***@localhost/sqlzoo
3 rows affected.

[('Manchester Metropolitan University', 80.0),
 ('The Manchester College', 71.0),
 ('University of Manchester', 83.0)]

## 8.Number of Computing Students in Manchester

**Show the institution, the total sample size and the number of computing students for institutions in Manchester for 'Q01'.**

In [11]:
%%sql
SELECT institution, SUM(sample),SUM(
    CASE WHEN subject='(8) Computer Science' THEN sample ELSE 0 END) comp
FROM nss
  WHERE question='Q01'
    AND (institution LIKE '%Manchester%')
    GROUP BY institution;

 * postgresql://postgres:***@localhost/sqlzoo
3 rows affected.

[('Manchester Metropolitan University', 6994, 310),
 ('The Manchester College', 537, 46),
 ('University of Manchester', 8065, 180)]